aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
/*
 * $ Copyright Cypress Semiconductor $
 */

/**
 * @file bt_manager.c
 * @brief Hardware Abstraction Layer for GAP ble stack.
 */

/* The config header is always included first. */
#include "iot_config.h"

#include <string.h>
#include <stdio.h>
#include "FreeRTOS.h"

#include "bt_hal_manager_adapter_ble.h"
#include "bt_hal_manager_adapter_classic.h"
#include "bt_hal_manager.h"
#include "bt_hal_gatt_server.h"
#include "bt_hal_internal.h"

#include "wiced_bt_dev.h"
#include "wiced_bt_gatt.h"
#include "wiced_bt_stack.h"

#include "platform_bt_nvram.h"

#include "cybt_platform_config.h"
#include "wiced_memory.h"

#include "cy_worker_thread.h"

extern const cybt_platform_config_t bt_platform_cfg_settings;

#define MAX_NUMBER_OF_BONDED_DEVIECS    5
#define STACK_INITIALIZATION_TIMEOUT    20000
#define ACE_BT_ADDRESS_ENTRY_LOCATION   13

#define WORKER_TASK_NAME                "worker_task"
#define WORKER_TASK_STACK_SIZE          2048

wiced_bool_t BTM_IsAclConnectionUp (wiced_bt_device_address_t remote_bda, wiced_bt_transport_t transport);
extern wiced_bt_cfg_settings_t wiced_bt_cfg_settings;

cy_worker_thread_info_t bt_worker_thread;

extern BTBleAdapterCallbacks_t xBTBleAdapterCallbacks;

WICEDPropCache_t xWICEDPropCache;
extern platform_bt_nvram_interface_t nvram_interface;
platform_bt_nvram_interface_t *pxWicedNvramInterface = &nvram_interface;

static BTCallbacks_t xBTCallbacks;
static cy_semaphore_t stack_init_semaphore;

BTStatus_t prvBTManagerInit( const BTCallbacks_t * pxCallbacks );
BTStatus_t prvBtManagerCleanup( void );
BTStatus_t prvBTEnable( uint8_t ucGuestMode );
BTStatus_t prvBTDisable();
BTStatus_t prvBTGetAllDeviceProperties();
BTStatus_t prvBTGetDeviceProperty( BTPropertyType_t xType );
BTStatus_t prvBTSetDeviceProperty( const BTProperty_t * pxProperty );
BTStatus_t prvBTGetAllRemoteDeviceProperties( BTBdaddr_t * pxRemoteAddr );
BTStatus_t prvBTGetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         BTPropertyType_t type );
BTStatus_t prvBTSetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         const BTProperty_t * property );
BTStatus_t prvBTPair( const BTBdaddr_t * pxBdAddr,
                      BTTransport_t xTransport,
                      bool bCreateBond );
BTStatus_t prvBTCreateBondOutOfBand( const BTBdaddr_t * pxBdAddr,
                                     BTTransport_t xTransport,
                                     const BTOutOfBandData_t * pxOobData );
static BTStatus_t prvBTSendSlaveSecurityRequest( const BTBdaddr_t * pxBdAddr,
                                                 BTSecurityLevel_t xSecurityLevel,
                                                 bool bBonding );
BTStatus_t prvBTCancelBond( const BTBdaddr_t * pxBdAddr );
BTStatus_t prvBTRemoveBond( const BTBdaddr_t * pxBdAddr );
BTStatus_t prvBTGetConnectionState( const BTBdaddr_t * pxBdAddr,
                                    bool * bConnectionState );
BTStatus_t prvBTPinReply( const BTBdaddr_t * pxBdAddr,
                          uint8_t ucAccept,
                          uint8_t ucPinLen,
                          BTPinCode_t * pxPinCode );
BTStatus_t prvBTSspReply( const BTBdaddr_t * pxBdAddr,
                          BTSspVariant_t xVariant,
                          uint8_t ucAccept,
                          uint32_t ulPasskey );
BTStatus_t prvBTReadEnergyInfo();
BTStatus_t prvBTDutModeConfigure( bool bEnable );
BTStatus_t prvBTDutModeSend( uint16_t usOpcode,
                             uint8_t * pucBuf,
                             size_t xLen );
BTStatus_t prvBTLeTestMode( uint16_t usOpcode,
                            uint8_t * pucBuf,
                            size_t xLen );
BTStatus_t prvBTConfigHCISnoopLog( bool bEnable );
BTStatus_t prvBTConfigClear();
BTStatus_t prvBTReadRssi( const BTBdaddr_t * pxBdAddr );
BTStatus_t prvBTGetTxpower( const BTBdaddr_t * pxBdAddr,
                            BTTransport_t xTransport );
const void * prvGetClassicAdapter();
const void * prvGetLeAdapter();
BTStatus_t CleanupGattServer(void);

uint32_t prvBTGetLastError( void );
BTStatus_t prvBTGetStackFeaturesSupport( uint32_t * pulFeatureMask );

static BTInterface_t xBTinterface =
{
    .pxBtManagerInit                = prvBTManagerInit,
    .pxBtManagerCleanup             = prvBtManagerCleanup,
    .pxEnable                       = prvBTEnable,
    .pxDisable                      = prvBTDisable,
    .pxGetAllDeviceProperties       = prvBTGetAllDeviceProperties,
    .pxGetDeviceProperty            = prvBTGetDeviceProperty,
    .pxSetDeviceProperty            = prvBTSetDeviceProperty,
    .pxGetAllRemoteDeviceProperties = prvBTGetAllRemoteDeviceProperties,
    .pxGetRemoteDeviceProperty      = prvBTGetRemoteDeviceProperty,
    .pxSetRemoteDeviceProperty      = prvBTSetRemoteDeviceProperty,
    .pxPair                         = prvBTPair,
    .pxCreateBondOutOfBand          = prvBTCreateBondOutOfBand,
    .pxSendSlaveSecurityRequest     = prvBTSendSlaveSecurityRequest,
    .pxCancelBond                   = prvBTCancelBond,
    .pxRemoveBond                   = prvBTRemoveBond,
    .pxGetConnectionState           = prvBTGetConnectionState,
    .pxPinReply                     = prvBTPinReply,
    .pxSspReply                     = prvBTSspReply,
    .pxReadEnergyInfo               = prvBTReadEnergyInfo,
    .pxDutModeConfigure             = prvBTDutModeConfigure,
    .pxDutModeSend                  = prvBTDutModeSend,
    .pxLeTestMode                   = prvBTLeTestMode,
    .pxConfigHCISnoopLog            = prvBTConfigHCISnoopLog,
    .pxConfigClear                  = prvBTConfigClear,
    .pxReadRssi                     = prvBTReadRssi,
    .pxGetTxpower                   = prvBTGetTxpower,
    .pxGetClassicAdapter            = prvGetClassicAdapter,
    .pxGetLeAdapter                 = prvGetLeAdapter,
    .pxGetLastError                 = prvBTGetLastError,
    // .pxGetStackFeaturesSupport      = prvBTGetStackFeaturesSupport
};

// extern BTClassicInterface_t xBTClassicAdapter;

/*-----------------------------------------------------------*/
BTStatus_t prvConvertWicedErrorToAfr (wiced_result_t xWicedErrorCode)
{
    BTStatus_t xAfrStatus;

    switch(xWicedErrorCode)
    {
        case WICED_SUCCESS:
            xAfrStatus = eBTStatusSuccess;
        break;

        case WICED_PENDING :
            xAfrStatus = eBTStatusNotReady;
        break;

        case WICED_BADARG :
            xAfrStatus = eBTStatusParamInvalid;
        break;

