aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
        case WICED_BADOPTION :
            xAfrStatus = eBTStatusParamInvalid;
        break;

        case WICED_UNSUPPORTED :
            xAfrStatus = eBTStatusParamInvalid;
        break;

        case WICED_OUT_OF_HEAP_SPACE :
            xAfrStatus = eBTStatusNoMem;
        break;

        case WICED_NOTUP :
            xAfrStatus = eBTStatusNotReady;
        break;

        case WICED_CONNECTION_LOST :
            xAfrStatus = eBTStatusRMTDevDown;
        break;

        case WICED_TIMEOUT :
        case WICED_PARTIAL_RESULTS :
        case WICED_ERROR :
        case WICED_UNFINISHED :
        case WICED_NOT_FOUND :
        case WICED_PACKET_BUFFER_CORRUPT :
        case WICED_CONNECTION_RESET :
        case WICED_CONNECTION_CLOSED :
        case WICED_NOT_CONNECTED :
        case WICED_ADDRESS_IN_USE :
        case WICED_NETWORK_INTERFACE_ERROR :
        case WICED_ALREADY_CONNECTED :
        case WICED_INVALID_INTERFACE :
        case WICED_SOCKET_CREATE_FAIL :
        case WICED_INVALID_SOCKET :
        case WICED_CORRUPT_PACKET_BUFFER :
        case WICED_UNKNOWN_NETWORK_STACK_ERROR :
        case WICED_ALREADY_INITIALIZED :
        default:
            xAfrStatus = eBTStatusFail;
        break;
    }

    return xAfrStatus;
}

uint32_t prvConvertCodToWICED(wiced_bt_dev_class_t codAfr)
{
    uint32_t cod = 0;

    for (int i = 0; i < 3; i++)
    {
        cod |= codAfr[i] << i * 8;
    }

    return cod;
}

uint32_t prvConvertIoCapToWICED(BTIOtypes_t IoCapWICED)
{
    uint32_t ioCap = 0;

    switch (IoCapWICED)
    {
        case eBTIONone:
            ioCap =  BTM_IO_CAPABILITIES_NONE;
            break;

        case eBTIODisplayOnly:
            ioCap =  BTM_IO_CAPABILITIES_DISPLAY_ONLY;
            break;

        case eBTIODisplayYesNo:
            ioCap = BTM_IO_CAPABILITIES_DISPLAY_AND_YES_NO_INPUT;
            break;

        case eBTIOKeyboardOnly:
            ioCap =  BTM_IO_CAPABILITIES_KEYBOARD_ONLY;
            break;

        case eBTIOKeyboardDisplay:
            ioCap =  BTM_IO_CAPABILITIES_BLE_DISPLAY_AND_KEYBOARD_INPUT;
            break;

        default:
            //@TODO:Is this a good default ??
            ioCap =  BTM_IO_CAPABILITIES_DISPLAY_AND_YES_NO_INPUT;
            break;
    }

    return ioCap;
}

/* bt/ble link management callback */
static wiced_result_t prvWicedBTManagementCb( wiced_bt_management_evt_t event,
                                              wiced_bt_management_evt_data_t *p_event_data )
{
    wiced_result_t result = WICED_BT_SUCCESS;
    bool bStart;
    BTStatus_t xStatus;
    static uint32_t bSecurityReqReceived = false;
    cy_worker_thread_params_t bt_worker_thread_param;

    IotLogDebug("prvWicedBTManagementCb, event=0x%x\n", event);

    switch ( event )
    {
        /* Bluetooth stack enabled */
        case BTM_ENABLED_EVT:

            /* Trigger On event only when the callback status is success. Timeout and shutdown events are ignored for now */
            if(p_event_data->enabled.status == WICED_SUCCESS)
            {
                //create a worker thread to send cb to app thread
                memset(&bt_worker_thread_param, 0, sizeof(bt_worker_thread_param));
                bt_worker_thread_param.priority = CY_RTOS_PRIORITY_MIN;
                bt_worker_thread_param.stack_size = WORKER_TASK_STACK_SIZE;
                bt_worker_thread_param.name = WORKER_TASK_NAME;
                if( CY_RSLT_SUCCESS != cy_worker_thread_create(&bt_worker_thread, &bt_worker_thread_param))
                    return WICED_BT_ERROR;

                //Set default IO cap.
                xWICEDPropCache.xIoCap = eBTIODisplayYesNo;
                xWICEDPropCache.bBondable = TRUE;
                xWICEDPropCache.bSecureConnectionOnly = true;

                /** If status is ok and callback is set, trigger the callback.
                 *  If status is fail, not need to trig a callback as original call failed.
                 **/
                if( xBTCallbacks.pxDeviceStateChangedCb != NULL )
                {
                    xBTCallbacks.pxDeviceStateChangedCb( eBTstateOn );
                }

                 /* Let the prvBTManagerInit know that the radio is initialized successfully.
                   Call this only after the pxDeviceStateChangedCb is made */
                if(((uint32_t *)&stack_init_semaphore) != NULL)
                {
                    cy_rtos_set_semaphore(&stack_init_semaphore, false );
                }
            }
            break;

        case BTM_DISABLED_EVT:
			if( xBTCallbacks.pxDeviceStateChangedCb != NULL )
            {
                xBTCallbacks.pxDeviceStateChangedCb( eBTstateOff );
            }
            break;

        case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:
            p_event_data->pairing_io_capabilities_ble_request.local_io_cap      = prvConvertIoCapToWICED( xWICEDPropCache.xIoCap );
            p_event_data->pairing_io_capabilities_ble_request.oob_data          = BTM_OOB_NONE;
            p_event_data->pairing_io_capabilities_ble_request.max_key_size      = 0x10;
            p_event_data->pairing_io_capabilities_ble_request.init_keys         = BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;
            p_event_data->pairing_io_capabilities_ble_request.resp_keys         = BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;

            if(xWICEDPropCache.bBondable && pxWicedNvramInterface != NULL)
            {
                p_event_data->pairing_io_capabilities_ble_request.auth_req = BTM_LE_AUTH_REQ_SC_MITM_BOND;
            }
            else
            {
                p_event_data->pairing_io_capabilities_ble_request.auth_req = BTM_LE_AUTH_REQ_SC_MITM;
            }

            //reset the SC flag if not requested by app
            p_event_data->pairing_io_capabilities_ble_request.auth_req &= ~((xWICEDPropCache.bSecureConnectionOnly) ? 0 : BTM_LE_AUTH_REQ_SC);
            break;

        case BTM_PAIRING_IO_CAPABILITIES_BR_EDR_REQUEST_EVT:
            /* Use the default security for BR/EDR*/
            p_event_data->pairing_io_capabilities_br_edr_request.local_io_cap = BTM_IO_CAPABILITIES_NONE;
            p_event_data->pairing_io_capabilities_br_edr_request.auth_req = BTM_AUTH_SINGLE_PROFILE_GENERAL_BONDING_NO;
            break;

        case BTM_PAIRING_COMPLETE_EVT:
            //reset the flag for next connction
            bSecurityReqReceived = false;

            xStatus = (0 == p_event_data->pairing_complete.pairing_complete_info.ble.status) ? eBTStatusSuccess : eBTStatusFail;

            IotLogDebug("ble.status : %d, ble.sec_level : %d, reason : %dn", p_event_data->pairing_complete.pairing_complete_info.ble.status, p_event_data->pairing_complete.pairing_complete_info.ble.sec_level, p_event_data->pairing_complete.pairing_complete_info.ble.reason);
            IotLogDebug("transport=%d, bda=%02x:%02x:%02x:%02x:%02x:%02xn",
                p_event_data->pairing_complete.transport,
                p_event_data->pairing_complete.bd_addr[0], p_event_data->pairing_complete.bd_addr[1], p_event_data->pairing_complete.bd_addr[2],
                p_event_data->pairing_complete.bd_addr[3], p_event_data->pairing_complete.bd_addr[4], p_event_data->pairing_complete.bd_addr[5]);
            if ( xBTCallbacks.pxPairingStateChangedCb )
                xBTCallbacks.pxPairingStateChangedCb( xStatus, (BTBdaddr_t *) p_event_data->pairing_complete.bd_addr, eBTbondStateBonded, p_event_data->pairing_complete.pairing_complete_info.ble.sec_level, p_event_data->pairing_complete.pairing_complete_info.ble.reason );
            break;

