aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
        case BTM_PIN_REQUEST_EVT:
            if (xBTCallbacks.pxPinRequestCb)
                xBTCallbacks.pxPinRequestCb((BTBdaddr_t *) p_event_data->pin_request.bd_addr,
                        (BTBdname_t*) p_event_data->pin_request.bd_name,
                        prvConvertCodToWICED( wiced_bt_cfg_settings.device_class ), 0);
            break;

        case BTM_USER_CONFIRMATION_REQUEST_EVT:
            if ( xBTCallbacks.pxSspRequestCb )
                xBTCallbacks.pxSspRequestCb( (BTBdaddr_t *) p_event_data->user_confirmation_request.bd_addr, &xWICEDPropCache.xBtName,
                        prvConvertCodToWICED( wiced_bt_cfg_settings.device_class ), eBTsspVariantPasskeyConfirmation, p_event_data->user_confirmation_request.numeric_value );
            break;

        case BTM_PASSKEY_REQUEST_EVT:
            if ( xBTCallbacks.pxSspRequestCb )
                xBTCallbacks.pxSspRequestCb( (BTBdaddr_t *) p_event_data->user_passkey_request.bd_addr, &xWICEDPropCache.xBtName,
                        prvConvertCodToWICED( wiced_bt_cfg_settings.device_class ), eBTsspVariantPasskeyEntry, 0);
            break;

        case BTM_PASSKEY_NOTIFICATION_EVT:
            if ( xBTCallbacks.pxSspRequestCb )
                xBTCallbacks.pxSspRequestCb( (BTBdaddr_t *) p_event_data->user_passkey_notification.bd_addr, &xWICEDPropCache.xBtName,
                        prvConvertCodToWICED( wiced_bt_cfg_settings.device_class ), eBTsspVariantPasskeyNotification, p_event_data->user_passkey_notification.passkey);
            break;

        case BTM_SECURITY_REQUEST_EVT:
            bSecurityReqReceived = true;
            if (xBTCallbacks.pxSspRequestCb)
                xBTCallbacks.pxSspRequestCb((BTBdaddr_t *)p_event_data->security_request.bd_addr, &xWICEDPropCache.xBtName,
                                            prvConvertCodToWICED(wiced_bt_cfg_settings.device_class), eBTsspVariantConsent, 0);
            break;

        case BTM_ENCRYPTION_STATUS_EVT:
            if (!bSecurityReqReceived)
            {
                if (xBTCallbacks.pxPairingStateChangedCb)
                {
                    xBTCallbacks.pxPairingStateChangedCb(eBTStatusSuccess, (BTBdaddr_t *)p_event_data->encryption_status.bd_addr, eBTbondStateBonded, eBTSecLevelSecureConnect, eBTauthSuccess);
                }
            }
            break;

        case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:
            if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->save_bonded_device_key != NULL)
            {
                pxWicedNvramInterface->save_bonded_device_key(
                        p_event_data->paired_device_link_keys_update.bd_addr,
                        (uint8_t *) &p_event_data->paired_device_link_keys_update.key_data,
                        sizeof(wiced_bt_device_sec_keys_t));
            #if 0//for OTA debug
                printf("\nLinkKey --> ");
                for(uint8_t idx=0 ;idx<LINK_KEY_LEN;idx++)
                    printf("%02x", p_event_data->paired_device_link_keys_update.key_data.le_keys.lltk[idx]);
                printf("\n\n");
            #endif
            }
            else
            {
                result = WICED_BT_UNSUPPORTED;
            }
            break;

        case BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:
            if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->load_bonded_device_keys != NULL)
            {
                result = pxWicedNvramInterface->load_bonded_device_keys( p_event_data->paired_device_link_keys_request.bd_addr, \
                        (uint8_t *)&p_event_data->paired_device_link_keys_request.key_data, sizeof(wiced_bt_device_sec_keys_t));
            }
            else
            {
                result = WICED_BT_KEY_MISSING;
            }
            break;

        case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT:
            if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->load_local_identity_keys != NULL)
            {
                result = pxWicedNvramInterface->load_local_identity_keys(&p_event_data->local_identity_keys_request);
            }
            else
            {
                result = WICED_BT_KEY_MISSING;
            }
            break;

        case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT:
            if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->save_local_identity_keys != NULL)
            {
                result = pxWicedNvramInterface->save_local_identity_keys(&p_event_data->local_identity_keys_update);
            }
            else
            {
                result = WICED_BT_UNSUPPORTED;
            }
            break;

        case BTM_BLE_ADVERT_STATE_CHANGED_EVT:
            bStart = (BTM_BLE_ADVERT_OFF == p_event_data->ble_advert_state_changed) ? 0 : 1;
            if ( xBTBleAdapterCallbacks.pxAdvStatusCb )
                xBTBleAdapterCallbacks.pxAdvStatusCb( eBTStatusSuccess, 1, bStart);
            break;

        case BTM_BLE_PHY_UPDATE_EVT:
            if(xBTBleAdapterCallbacks.pxPhyUpdatedCb)
            {
                xBTBleAdapterCallbacks.pxPhyUpdatedCb( xWICEDPropCache.ucAdapterIfCache, p_event_data->ble_phy_update_event.tx_phy, p_event_data->ble_phy_update_event.rx_phy, p_event_data->ble_phy_update_event.status);
            }
            break;

        case BTM_MULTI_ADVERT_RESP_EVENT:
            IotLogDebug("opcode=%d, status=%d\n", p_event_data->ble_multi_adv_response_event.opcode, p_event_data->ble_multi_adv_response_event.status);
            break;

        default:
            break;
    }

    return result;
}

BTStatus_t prvBTManagerInit( const BTCallbacks_t * pxCallbacks )
{
    BTStatus_t xStatus = eBTStatusFail;
    wiced_result_t result;

    if( pxCallbacks != NULL )
    {
        xBTCallbacks = *pxCallbacks;
    }
    else
    {
        return eBTStatusParamInvalid;
    }

    //provide buffer for xBtName
    xWICEDPropCache.xBtName.ucName = xWICEDPropCache.pucDevName;

    cybt_platform_config_init(&bt_platform_cfg_settings);
    result = wiced_bt_stack_init( prvWicedBTManagementCb, &wiced_bt_cfg_settings );
    if ( WICED_SUCCESS != result )
    {
        IotLogDebug("wiced_bt_stack_init failed\n");
        return prvConvertWicedErrorToAfr(result);
    }

    /* Amazon requested to wait in this API and return only when radio is turned on */
    if( CY_RSLT_SUCCESS == cy_rtos_init_semaphore(&stack_init_semaphore, 1, 0) )
    {
         /* 20s timeout for stack initialization */
        if( CY_RSLT_SUCCESS == cy_rtos_get_semaphore(&stack_init_semaphore, STACK_INITIALIZATION_TIMEOUT, false) ) //CY_RTOS_NEVER_TIMEOUT
        {
            xStatus = eBTStatusSuccess;
        }
        cy_rtos_deinit_semaphore(&stack_init_semaphore);
    }

