aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
    if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->init != NULL)
    {
        pxWicedNvramInterface->init();
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBtManagerCleanup()
{
    BTStatus_t xStatus = eBTStatusSuccess;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTEnable( uint8_t ucGuestMode )
{

    return eBTStatusSuccess;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDisable()
{
    BTStatus_t xStatus = eBTStatusSuccess;
    wiced_result_t result;

    CleanupGattServer();

    result = wiced_bt_stack_deinit();
    xStatus = prvConvertWicedErrorToAfr(result);

    /** If status is ok and callback is set, trigger the callback.
     *  If status is fail, not need to trig a callback as original call failed.
     **/
    if( ( xStatus == eBTStatusSuccess ) && ( xBTCallbacks.pxDeviceStateChangedCb != NULL ) )
    {
        xBTCallbacks.pxDeviceStateChangedCb( eBTstateOff );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetAllDeviceProperties()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetDeviceProperty( BTPropertyType_t xType )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    BTProperty_t xReturnedProperty;
    wiced_bt_device_address_t bda;
    wiced_bt_device_address_t paired_device_list[MAX_NUMBER_OF_BONDED_DEVIECS];
    wiced_bt_dev_bonded_device_info_t ram_bonded_device_list[MAX_NUMBER_OF_BONDED_DEVIECS];
    uint16_t usDevNum = 0, idx;
    BTDeviceType_t DeviceType = eBTdeviceDevtypeBle;

    if( xBTCallbacks.pxAdapterPropertiesCb != NULL )
    {
        xReturnedProperty.xType = xType;

        switch( xType )
        {
            case eBTpropertyBdname:
                xReturnedProperty.xType = eBTpropertyBdname;
                xReturnedProperty.pvVal = xWICEDPropCache.pucDevName;
                xReturnedProperty.xLen = strlen((const char*)xWICEDPropCache.pucDevName);

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            case eBTpropertyBdaddr:
                wiced_bt_dev_read_local_addr(bda);
		        xReturnedProperty.xLen = sizeof(wiced_bt_device_address_t);
				xReturnedProperty.xType = eBTpropertyBdaddr;
				xReturnedProperty.pvVal = bda;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            case eBTpropertyTypeOfDevice:
                xReturnedProperty.xLen = 1;
                xReturnedProperty.xType = eBTpropertyTypeOfDevice;
                xReturnedProperty.pvVal = &DeviceType;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

    		case eBTpropertyAdapterBondedDevices:
    		    if(pxWicedNvramInterface != NULL && pxWicedNvramInterface->get_bonded_devices != NULL)
                {
    		        pxWicedNvramInterface->get_bonded_devices( paired_device_list, &usDevNum );
                }
                else
                {
                    //FIXME!!! get the list from NVRAM only
                    wiced_bt_dev_get_bonded_devices( ram_bonded_device_list, &usDevNum );

                    for(idx=0;idx<usDevNum;idx++)
                    {
                        memcpy(&paired_device_list[idx], ram_bonded_device_list[idx].bd_addr, 6);
                    }
                }

                xReturnedProperty.xLen = usDevNum * sizeof(wiced_bt_device_address_t);
                xReturnedProperty.xType = xType;
                xReturnedProperty.pvVal = paired_device_list;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
			break;

            case eBTpropertyRemoteFriendlyName:
            case eBTpropertyRemoteRssi:
            case eBTpropertyRemoteVersionInfo:
                // how do we know which remote are we talking about???
                xStatus = eBTStatusUnsupported;
                break;

            case eBTpropertyLocalMTUSize:
                xReturnedProperty.xLen = 1;
                xReturnedProperty.xType = eBTpropertyLocalMTUSize;
                xReturnedProperty.pvVal = (void*)&wiced_bt_cfg_settings.gatt_cfg.max_mtu_size;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            case eBTpropertyBondable:
                xReturnedProperty.xLen = sizeof(bool);
                xReturnedProperty.xType = eBTpropertyBondable;
                xReturnedProperty.pvVal = &xWICEDPropCache.bBondable;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            case eBTpropertyIO:
                xReturnedProperty.xLen = sizeof(BTIOtypes_t);
                xReturnedProperty.xType = eBTpropertyIO;
                xReturnedProperty.pvVal = &xWICEDPropCache.xIoCap;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            case eBTpropertySecureConnectionOnly:
                xReturnedProperty.xLen = sizeof(bool);
                xReturnedProperty.xType = eBTpropertySecureConnectionOnly;
                xReturnedProperty.pvVal = &xWICEDPropCache.bSecureConnectionOnly;

                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
		break;

            case eBTpropertyConnectable:
                xReturnedProperty.xLen = sizeof(bool);
                xReturnedProperty.xType = eBTpropertyConnectable;
                xReturnedProperty.pvVal = &xWICEDPropCache.bConnectable;

