aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
                if (xBTCallbacks.pxAdapterPropertiesCb)
                    xBTCallbacks.pxAdapterPropertiesCb(eBTStatusSuccess, 1, &xReturnedProperty);
                break;

            default:
                xStatus = eBTStatusUnsupported;
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetDeviceProperty( const BTProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    char * pcName;

    switch( pxProperty->xType )
    {
        case eBTpropertyBdname:
            pcName = pvPortMalloc( pxProperty->xLen + 1 );

            if( pcName != NULL )
            {
                memcpy( pcName, pxProperty->pvVal, pxProperty->xLen );
                /* Add NULL termination for name string */
                pcName[ pxProperty->xLen ] = '\0';

                memcpy(xWICEDPropCache.pucDevName, pcName, strlen(pcName));
                vPortFree( pcName );
            }
            else
            {
                xStatus = eBTStatusNoMem;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyBdaddr:
            wiced_bt_set_local_bdaddr(pxProperty->pvVal, BLE_ADDR_PUBLIC);

		if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }
            break;

        case eBTpropertyTypeOfDevice:
            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertyLocalMTUSize:
            wiced_bt_cfg_settings.gatt_cfg.max_mtu_size = *(uint16_t *)pxProperty->pvVal;
            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }
            break;

        case eBTpropertyBondable:
            xWICEDPropCache.bBondable = *(bool *)pxProperty->pvVal;
            wiced_bt_set_pairable_mode(xWICEDPropCache.bBondable, false);

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ))
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }
            break;

        case eBTpropertyIO:
            xWICEDPropCache.xIoCap = (*(BTIOtypes_t *)pxProperty->pvVal);

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }
            break;

        case eBTpropertyRemoteFriendlyName:
            // how do we know which remote are we talking about???
            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertySecureConnectionOnly:
            xWICEDPropCache.bSecureConnectionOnly = *(bool*)pxProperty->pvVal;

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }
            break;

        case eBTpropertyConnectable:
            xWICEDPropCache.bConnectable = (*(bool *)pxProperty->pvVal) ? BTM_CONNECTABLE : BTM_NON_CONNECTABLE;

            wiced_bt_dev_set_connectability(xWICEDPropCache.bConnectable,  BTM_DEFAULT_CONN_WINDOW,  BTM_DEFAULT_CONN_INTERVAL );

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        default:
            xStatus = eBTStatusUnsupported;
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetAllRemoteDeviceProperties( BTBdaddr_t * pxRemoteAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         BTPropertyType_t type )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                         const BTProperty_t * property )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTPair( const BTBdaddr_t * pxBdAddr,
                      BTTransport_t xTransport,
                      bool bCreateBond )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTCreateBondOutOfBand( const BTBdaddr_t * pxBdAddr,
                                     BTTransport_t xTransport,
                                     const BTOutOfBandData_t * pxOobData )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

static BTStatus_t prvBTSendSlaveSecurityRequest( const BTBdaddr_t * pxBdAddr,
                                                 BTSecurityLevel_t xSecurityLevel,
                                                 bool bBonding )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTCancelBond( const BTBdaddr_t * pxBdAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTRemoveBond( const BTBdaddr_t * pxBdAddr )
{
    BTStatus_t xStatus = eBTStatusFail;
    wiced_bt_device_address_t xAddress;
    wiced_result_t xWicedStatus;

    memcpy(xAddress, pxBdAddr, sizeof(wiced_bt_device_address_t));
    xWicedStatus = wiced_bt_dev_delete_bonded_device(xAddress);

