aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ble/iot_ble_hal_manager.c
    if(xWicedStatus == WICED_SUCCESS)
    {
        if (pxWicedNvramInterface!= NULL && pxWicedNvramInterface->delete_bonded_device != NULL)
        {
            if (WICED_SUCCESS == pxWicedNvramInterface->delete_bonded_device(xAddress))
            {
                xStatus = eBTStatusSuccess;
            }
        }
        else
        {
            xStatus = eBTStatusSuccess;
        }
    }
    else
    {
        xStatus = prvConvertWicedErrorToAfr(xWicedStatus);
    }
    if ( xBTCallbacks.pxPairingStateChangedCb )
    {
        xBTCallbacks.pxPairingStateChangedCb( eBTStatusSuccess, (BTBdaddr_t *)pxBdAddr, eBTbondStateNone, eBTSecLevelSecureConnect, eBTauthSuccess);
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetConnectionState( const BTBdaddr_t * pxBdAddr,
                                    bool * bConnectionState )
{
    if( BTM_IsAclConnectionUp ( (uint8_t*) pxBdAddr->ucAddress, BT_TRANSPORT_BR_EDR ) )
    {
        *bConnectionState = true;
    }
    else if( BTM_IsAclConnectionUp ( (uint8_t*) pxBdAddr->ucAddress, BT_TRANSPORT_BR_EDR ) )
    {
        *bConnectionState = true;
    }
    else
    {
        *bConnectionState = false;
    }

    return eBTStatusSuccess;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTPinReply( const BTBdaddr_t * pxBdAddr,
                          uint8_t ucAccept,
                          uint8_t ucPinLen,
                          BTPinCode_t * pxPinCode )
{
    uint8_t ucStatus = ( 1 == ucAccept ) ? WICED_BT_SUCCESS : WICED_BT_ERROR;
    wiced_bt_dev_pin_code_reply( (uint8_t*) pxBdAddr->ucAddress, ucStatus, ucPinLen, (uint8_t*) pxPinCode );

    return eBTStatusSuccess;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSspReply( const BTBdaddr_t * pxBdAddr,
                          BTSspVariant_t xVariant,
                          uint8_t ucAccept,
                          uint32_t ulPasskey )
{
    uint8_t ucStatus = ( 1 == ucAccept ) ? WICED_BT_SUCCESS : WICED_BT_ERROR;

    switch ( xVariant )
    {
        case eBTsspVariantPasskeyConfirmation:
            wiced_bt_dev_confirm_req_reply(ucStatus, (uint8_t *) ( pxBdAddr->ucAddress ));
            break;
        case eBTsspVariantPasskeyEntry:
            wiced_bt_dev_pass_key_req_reply( ucStatus, (uint8_t *) ( pxBdAddr->ucAddress ), ulPasskey );
            break;
        case eBTsspVariantConsent:
            wiced_bt_ble_security_grant( (uint8_t *) ( pxBdAddr->ucAddress ), ucStatus );
            break;
        case eBTsspVariantPasskeyNotification:
            break;

        default:
            break;
    }

    return eBTStatusSuccess;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTReadEnergyInfo()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeConfigure( bool bEnable )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeSend( uint16_t usOpcode,
                             uint8_t * pucBuf,
                             size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTLeTestMode( uint16_t usOpcode,
                            uint8_t * pucBuf,
                            size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigHCISnoopLog( bool bEnable )
{
    return eBTStatusUnsupported;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigClear()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/
/* RSSI report handler */
static void prvRssiCb( void *pxRssi )
{
    BTStatus_t xStatus = eBTStatusFail;
    wiced_bt_dev_rssi_result_t *pxRssiRsult = (wiced_bt_dev_rssi_result_t*) pxRssi;

    if ( ( pxRssiRsult->status == WICED_BT_SUCCESS ) && ( pxRssiRsult->hci_status == HCI_SUCCESS ) )
    {
        xStatus = eBTStatusSuccess;
    }
    else
    {
        xStatus = prvConvertWicedErrorToAfr(pxRssiRsult->status);
    }

    if ( xBTCallbacks.pxReadRssiCb )
        xBTCallbacks.pxReadRssiCb( (BTBdaddr_t *) pxRssiRsult->rem_bda, pxRssiRsult->rssi, xStatus );
}

BTStatus_t prvBTReadRssi( const BTBdaddr_t * pxBdAddr )
{
    wiced_result_t xWicedStatus;

    xWicedStatus = wiced_bt_dev_read_rssi((uint8_t *) ( pxBdAddr->ucAddress ), BT_TRANSPORT_BR_EDR, prvRssiCb);

    return prvConvertWicedErrorToAfr(xWicedStatus);
}

/*-----------------------------------------------------------*/
/* TX Power report handler */
static void prvTxPowerCb( wiced_bt_tx_power_result_t *pxTxPower )
{
    BTStatus_t xStatus = eBTStatusFail;

    //@TODO: change the implementation to support classic as well (i.e, cache this when prvBTGetTxpower is invoked and give to the callback here)
    BTTransport_t xTransport = BTTransportLe;

    if ( ( pxTxPower->status == WICED_BT_SUCCESS ) && ( pxTxPower->hci_status == HCI_SUCCESS ) )
    {
        xStatus = eBTStatusSuccess;
    }
    else
    {
        xStatus = prvConvertWicedErrorToAfr(pxTxPower->status);
    }

    if ( xBTCallbacks.pxTxPowerCb )
        xBTCallbacks.pxTxPowerCb( (BTBdaddr_t *) pxTxPower->rem_bda, xTransport, pxTxPower->tx_power, xStatus );
}

BTStatus_t prvBTGetTxpower( const BTBdaddr_t * pxBdAddr,
                            BTTransport_t xTransport )
{
    wiced_bt_transport_t xWicedTransport = 0;

    if ( BTTransportBredr == xTransport )
    {
        xWicedTransport = BT_TRANSPORT_BR_EDR;
    }
    else if ( BTTransportLe == xTransport )
    {
        xWicedTransport = BT_TRANSPORT_LE;
    }

    if ( xTransport )
    {
        wiced_bt_dev_read_tx_power( (uint8_t *) ( pxBdAddr->ucAddress ), xWicedTransport, (wiced_bt_dev_cmpl_cback_t *) prvTxPowerCb );
        return eBTStatusSuccess;
    }
    else
    {
        return eBTStatusFail;
    }
}

/*-----------------------------------------------------------*/

const void * prvGetClassicAdapter()
{
    // return &xBTClassicAdapter;
    return NULL;
}

/*-----------------------------------------------------------*/

const BTInterface_t * BTGetBluetoothInterface()
{
    return &xBTinterface;
}

/*
 * Function     platform_bt_nvram_interface_register
 *
 * Platform NVRAM read/modify/write interaface registration API
 *
 * param:   platform_bt_nvram_interface_t* : Pointer to platform NVRAM interface APIs
 * return:  Always returns WICED_TRUE. Platform can pass a NULL Pointer to un-register the NVRAM interface
 */
wiced_result_t platform_bt_nvram_interface_register(platform_bt_nvram_interface_t *pxPlatformNvRam)
{
    pxWicedNvramInterface = pxPlatformNvRam;
    return WICED_SUCCESS;
}

uint32_t prvBTGetLastError( void )
{
    return 0;
}

BTStatus_t prvBTGetStackFeaturesSupport( uint32_t * pulFeatureMask )
{
    return eBTStatusUnsupported;
}
